---
kind: other
id: Properties.T:Autodesk.Revit.DB.SolidCurveIntersectionOptions
source: html/c1c66075-3aee-b950-645b-72cc961c66c5.htm
---
# SolidCurveIntersectionOptions Properties

Specifies whether the .NET object represents a valid Revit entity.